RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Include/gd32h77x_78x_gpio.h
/* GPIO_AFSEL2 */
#define GPIO_AFSEL2_PIN0_AF_BIT4   BIT(0)                          /*!< pin 0 alternate function selected BIT4 */
#define GPIO_AFSEL2_PIN1_AF_BIT4   BIT(1)                          /*!< pin 1 alternate function selected BIT4 */
#define GPIO_AFSEL2_PIN2_AF_BIT4   BIT(2)                          /*!< pin 2 alternate function selected BIT4 */
#define GPIO_AFSEL2_PIN3_AF_BIT4   BIT(3)                          /*!< pin 3 alternate function selected BIT4 */
#define GPIO_AFSEL2_PIN4_AF_BIT4   BIT(4)                          /*!< pin 4 alternate function selected BIT4 */
#define GPIO_AFSEL2_PIN5_AF_BIT4   BIT(5)                          /*!< pin 5 alternate function selected BIT4 */
#define GPIO_AFSEL2_PIN6_AF_BIT4   BIT(6)                          /*!< pin 6 alternate function selected BIT4 */
#define GPIO_AFSEL2_PIN7_AF_BIT4   BIT(7)                          /*!< pin 7 alternate function selected BIT4 */
#define GPIO_AFSEL2_PIN8_AF_BIT4   BIT(8)                          /*!< pin 8 alternate function selected BIT4 */
#define GPIO_AFSEL2_PIN9_AF_BIT4   BIT(9)                          /*!< pin 9 alternate function selected BIT4 */
#define GPIO_AFSEL2_PIN10_AF_BIT4  BIT(10)                         /*!< pin 10 alternate function selected BIT4 */
#define GPIO_AFSEL2_PIN11_AF_BIT4  BIT(11)                         /*!< pin 11 alternate function selected BIT4 */
#define GPIO_AFSEL2_PIN12_AF_BIT4  BIT(12)                         /*!< pin 12 alternate function selected BIT4 */
#define GPIO_AFSEL2_PIN13_AF_BIT4  BIT(13)                         /*!< pin 13 alternate function selected BIT4 */
#define GPIO_AFSEL2_PIN14_AF_BIT4  BIT(14)                         /*!< pin 14 alternate function selected BIT4 */
#define GPIO_AFSEL2_PIN15_AF_BIT4  BIT(15)                         /*!< pin 15 alternate function selected BIT4 */

/* GPIO_BC */
#define GPIO_BC_CR0                BIT(0)                          /*!< pin 0 clear bit */
#define GPIO_BC_CR1                BIT(1)                          /*!< pin 1 clear bit */
#define GPIO_BC_CR2                BIT(2)                          /*!< pin 2 clear bit */
#define GPIO_BC_CR3                BIT(3)                          /*!< pin 3 clear bit */
#define GPIO_BC_CR4                BIT(4)                          /*!< pin 4 clear bit */
#define GPIO_BC_CR5                BIT(5)                          /*!< pin 5 clear bit */
#define GPIO_BC_CR6                BIT(6)                          /*!< pin 6 clear bit */
#define GPIO_BC_CR7                BIT(7)                          /*!< pin 7 clear bit */
#define GPIO_BC_CR8                BIT(8)                          /*!< pin 8 clear bit */
#define GPIO_BC_CR9                BIT(9)                          /*!< pin 9 clear bit */
#define GPIO_BC_CR10               BIT(10)                         /*!< pin 10 clear bit */
#define GPIO_BC_CR11               BIT(11)                         /*!< pin 11 clear bit */
#define GPIO_BC_CR12               BIT(12)                         /*!< pin 12 clear bit */
#define GPIO_BC_CR13               BIT(13)                         /*!< pin 13 clear bit */
#define GPIO_BC_CR14               BIT(14)                         /*!< pin 14 clear bit */
#define GPIO_BC_CR15               BIT(15)                         /*!< pin 15 clear bit */

/* GPIO_TG */
#define GPIO_TG_TG0                BIT(0)                          /*!< pin 0 toggle bit */
#define GPIO_TG_TG1                BIT(1)                          /*!< pin 1 toggle bit */
#define GPIO_TG_TG2                BIT(2)                          /*!< pin 2 toggle bit */
#define GPIO_TG_TG3                BIT(3)                          /*!< pin 3 toggle bit */
#define GPIO_TG_TG4                BIT(4)                          /*!< pin 4 toggle bit */
#define GPIO_TG_TG5                BIT(5)                          /*!< pin 5 toggle bit */
#define GPIO_TG_TG6                BIT(6)                          /*!< pin 6 toggle bit */
#define GPIO_TG_TG7                BIT(7)                          /*!< pin 7 toggle bit */
#define GPIO_TG_TG8                BIT(8)                          /*!< pin 8 toggle bit */
#define GPIO_TG_TG9                BIT(9)                          /*!< pin 9 toggle bit */
#define GPIO_TG_TG10               BIT(10)                         /*!< pin 10 toggle bit */
#define GPIO_TG_TG11               BIT(11)                         /*!< pin 11 toggle bit */
#define GPIO_TG_TG12               BIT(12)                         /*!< pin 12 toggle bit */
#define GPIO_TG_TG13               BIT(13)                         /*!< pin 13 toggle bit */
#define GPIO_TG_TG14               BIT(14)                         /*!< pin 14 toggle bit */
#define GPIO_TG_TG15               BIT(15)                         /*!< pin 15 toggle bit */

/* GPIO_IFL */
#define GPIO_IFL_FLPRD0            BITS(0,7)                       /*!< filter sampling period for GPIO1 to GPIO7 */
#define GPIO_IFL_FLPRD1            BITS(8,15)                      /*!< filter sampling period for GPIO8 to GPIO15 */

/* GPIO_IFTP */
#define GPIO_IFTP_IFTP0            BITS(0,1)                       /*!< pin 0 input filtering type bits */
#define GPIO_IFTP_IFTP1            BITS(2,3)                       /*!< pin 1 input filtering type bits */
#define GPIO_IFTP_IFTP2            BITS(4,5)                       /*!< pin 2 input filtering type bits */
#define GPIO_IFTP_IFTP3            BITS(6,7)                       /*!< pin 3 input filtering type bits */
#define GPIO_IFTP_IFTP4            BITS(8,9)                       /*!< pin 4 input filtering type bits */
#define GPIO_IFTP_IFTP5            BITS(10,11)                     /*!< pin 5 input filtering type bits */
#define GPIO_IFTP_IFTP6            BITS(12,13)                     /*!< pin 6 input filtering type bits */
#define GPIO_IFTP_IFTP7            BITS(14,15)                     /*!< pin 7 input filtering type bits */
#define GPIO_IFTP_IFTP8            BITS(16,17)                     /*!< pin 8 input filtering type bits */
#define GPIO_IFTP_IFTP9            BITS(18,19)                     /*!< pin 9 input filtering type bits */
#define GPIO_IFTP_IFTP10           BITS(20,21)                     /*!< pin 10 input filtering type bits */
#define GPIO_IFTP_IFTP11           BITS(22,23)                     /*!< pin 11 input filtering type bits */
#define GPIO_IFTP_IFTP12           BITS(24,25)                     /*!< pin 12 input filtering type bits */
#define GPIO_IFTP_IFTP13           BITS(26,27)                     /*!< pin 13 input filtering type bits */
#define GPIO_IFTP_IFTP14           BITS(28,29)                     /*!< pin 14 input filtering type bits */
#define GPIO_IFTP_IFTP15           BITS(30,31)                     /*!< pin 15 input filtering type bits */

/* constants definitions */
typedef FlagStatus bit_status;

/* output mode definitions */
#define CTL_CLTR(regval)           (BITS(0,1) & ((uint32_t)(regval) << 0))
#define GPIO_MODE_INPUT            CTL_CLTR(0)                     /*!< input mode */
#define GPIO_MODE_OUTPUT           CTL_CLTR(1)                     /*!< output mode */
#define GPIO_MODE_AF               CTL_CLTR(2)                     /*!< alternate function mode */
#define GPIO_MODE_ANALOG           CTL_CLTR(3)                     /*!< analog mode */

