RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Include/gd32h77x_78x_gpio.h
/* pull-up/pull-down definitions */
#define PUD_PUPD(regval)           (BITS(0,1) & ((uint32_t)(regval) << 0))
#define GPIO_PUPD_NONE             PUD_PUPD(0)                     /*!< floating mode, no pull-up and pull-down resistors */
#define GPIO_PUPD_PULLUP           PUD_PUPD(1)                     /*!< with pull-up resistor */
#define GPIO_PUPD_PULLDOWN         PUD_PUPD(2)                     /*!< with pull-down resistor */

/* GPIO pin definitions */
#define GPIO_PIN_0                 BIT(0)                          /*!< GPIO pin 0 */
#define GPIO_PIN_1                 BIT(1)                          /*!< GPIO pin 1 */
#define GPIO_PIN_2                 BIT(2)                          /*!< GPIO pin 2 */
#define GPIO_PIN_3                 BIT(3)                          /*!< GPIO pin 3 */
#define GPIO_PIN_4                 BIT(4)                          /*!< GPIO pin 4 */
#define GPIO_PIN_5                 BIT(5)                          /*!< GPIO pin 5 */
#define GPIO_PIN_6                 BIT(6)                          /*!< GPIO pin 6 */
#define GPIO_PIN_7                 BIT(7)                          /*!< GPIO pin 7 */
#define GPIO_PIN_8                 BIT(8)                          /*!< GPIO pin 8 */
#define GPIO_PIN_9                 BIT(9)                          /*!< GPIO pin 9 */
#define GPIO_PIN_10                BIT(10)                         /*!< GPIO pin 10 */
#define GPIO_PIN_11                BIT(11)                         /*!< GPIO pin 11 */
#define GPIO_PIN_12                BIT(12)                         /*!< GPIO pin 12 */
#define GPIO_PIN_13                BIT(13)                         /*!< GPIO pin 13 */
#define GPIO_PIN_14                BIT(14)                         /*!< GPIO pin 14 */
#define GPIO_PIN_15                BIT(15)                         /*!< GPIO pin 15 */
#define GPIO_PIN_ALL               BITS(0,15)                      /*!< GPIO pin all */

/* GPIO mode configuration values */
#define GPIO_MODE_SET(n, mode)     ((uint32_t)((uint32_t)(mode) << (2U * (n))))
#define GPIO_MODE_MASK(n)          (0x3U << (2U * (n)))

/* GPIO pull-up/pull-down values */
#define GPIO_PUPD_SET(n, pupd)     ((uint32_t)((uint32_t)(pupd) << (2U * (n))))
#define GPIO_PUPD_MASK(n)          (0x3U << (2U * (n)))

/* GPIO output speed values */
#define GPIO_OSPEED_SET(n, speed)  ((uint32_t)((uint32_t)(speed) << (2U * (n))))
#define GPIO_OSPEED_MASK(n)        (0x3U << (2U * (n)))

/* GPIO output type */
#define GPIO_OTYPE_PP              ((uint8_t)(0x00U))              /*!< push pull mode */
#define GPIO_OTYPE_OD              ((uint8_t)(0x01U))              /*!< open drain mode */

/* GPIO output max speed value */
#define OSPD_OSPD0(regval)         (BITS(0,1) & ((uint32_t)(regval) << 0))
#define GPIO_OSPEED_12MHZ           OSPD_OSPD0(0)                   /*!< output max speed 12MHz */
#define GPIO_OSPEED_60MHZ           OSPD_OSPD0(1)                   /*!< output max speed 60MHz */
#define GPIO_OSPEED_85MHZ           OSPD_OSPD0(2)                   /*!< output max speed 85MHz */
#define GPIO_OSPEED_100_220MHZ      OSPD_OSPD0(3)                   /*!< output max speed 100/220MHz */

/* GPIO input filter type values */
#define GPIO_IFTYPE_SET(n, type)   ((uint32_t)((uint32_t)(type) << (2U * (n))))
#define GPIO_IFTYPE_MASK(n)        (0x3U << (2U * (n)))

/* GPIO input filter sample period */
#define IFL_FLPRD0(regval)         (BITS(0,7) & ((uint32_t)(regval) << 0))
#define GPIO_ISPERIOD(vle)         IFL_FLPRD0(vle)                 /*!< input filter sample period */

/* GPIO input filtering type */
#define IFTYPE_IFTP0(regval)       (BITS(0,1) & ((uint32_t)(regval) << 0))
#define GPIO_IFTYPE_SYNC           IFTYPE_IFTP0(0)                 /*!< input filter type synchronization */
#define GPIO_IFTYPE_3_SAMPLE       IFTYPE_IFTP0(1)                 /*!< input filter type filter 3 samples */
#define GPIO_IFTYPE_6_SAMPLE       IFTYPE_IFTP0(2)                 /*!< input filter type filter 6 samples */
#define GPIO_IFTYPE_ASYNC          IFTYPE_IFTP0(3)                 /*!< input filter type asynchronous */

/* GPIO alternate function values */
#define GPIO_AFR_SET(n, af)        ((uint32_t)((uint32_t)(af) << (4U * (n))))
#define GPIO_AFR_MASK(n)           (0xFU << (4U * (n)))

/* GPIO alternate function */
#define AF(regval)                 (BITS(0,4) & ((uint32_t)(regval) << 0))
#define GPIO_AF_0                  AF(0)                           /*!< alternate function 0 selected */
#define GPIO_AF_1                  AF(1)                           /*!< alternate function 1 selected */
#define GPIO_AF_2                  AF(2)                           /*!< alternate function 2 selected */
#define GPIO_AF_3                  AF(3)                           /*!< alternate function 3 selected */
#define GPIO_AF_4                  AF(4)                           /*!< alternate function 4 selected */
#define GPIO_AF_5                  AF(5)                           /*!< alternate function 5 selected */
#define GPIO_AF_6                  AF(6)                           /*!< alternate function 6 selected */
#define GPIO_AF_7                  AF(7)                           /*!< alternate function 7 selected */
#define GPIO_AF_8                  AF(8)                           /*!< alternate function 8 selected */
#define GPIO_AF_9                  AF(9)                           /*!< alternate function 9 selected */
#define GPIO_AF_10                 AF(10)                          /*!< alternate function 10 selected */
#define GPIO_AF_11                 AF(11)                          /*!< alternate function 11 selected */
#define GPIO_AF_12                 AF(12)                          /*!< alternate function 12 selected */
#define GPIO_AF_13                 AF(13)                          /*!< alternate function 13 selected */
#define GPIO_AF_14                 AF(14)                          /*!< alternate function 14 selected */
#define GPIO_AF_15                 AF(15)                          /*!< alternate function 15 selected */
#define GPIO_AF_16                 AF(16)                          /*!< alternate function 16 selected */
#define GPIO_AF_17                 AF(17)                          /*!< alternate function 17 selected */
#define GPIO_AF_18                 AF(18)                          /*!< alternate function 18 selected */
#define GPIO_AF_19                 AF(19)                          /*!< alternate function 19 selected */
#define GPIO_AF_20                 AF(20)                          /*!< alternate function 20 selected */
#define GPIO_AF_21                 AF(21)                          /*!< alternate function 21 selected */
#define GPIO_AF_22                 AF(22)                          /*!< alternate function 22 selected */
#define GPIO_AF_23                 AF(23)                          /*!< alternate function 23 selected */
#define GPIO_AF_24                 AF(24)                          /*!< alternate function 24 selected */
#define GPIO_AF_25                 AF(25)                          /*!< alternate function 25 selected */
#define GPIO_AF_26                 AF(26)                          /*!< alternate function 26 selected */
#define GPIO_AF_27                 AF(27)                          /*!< alternate function 27 selected */
#define GPIO_AF_28                 AF(28)                          /*!< alternate function 28 selected */
#define GPIO_AF_29                 AF(29)                          /*!< alternate function 29 selected */
#define GPIO_AF_30                 AF(30)                          /*!< alternate function 30 selected */
#define GPIO_AF_31                 AF(31)                          /*!< alternate function 31 selected */

/* function declarations */
/* reset GPIO port */
void gpio_deinit(uint32_t gpio_periph);
/* set GPIO mode */
void gpio_mode_set(uint32_t gpio_periph, uint32_t mode, uint32_t pull_up_down, uint32_t pin);
/* set GPIO output type and speed */
void gpio_output_options_set(uint32_t gpio_periph, uint8_t otype, uint32_t speed, uint32_t pin);

/* set GPIO pin bit */
void gpio_bit_set(uint32_t gpio_periph, uint32_t pin);
/* reset GPIO pin bit */
void gpio_bit_reset(uint32_t gpio_periph, uint32_t pin);
/* write data to the specified GPIO pin */
void gpio_bit_write(uint32_t gpio_periph, uint32_t pin, bit_status bit_value);
/* write data to the specified GPIO port */
void gpio_port_write(uint32_t gpio_periph, uint16_t data);

/* set GPIO input filter */
void gpio_input_filter_set(uint32_t gpio_periph, uint8_t speriod, uint32_t iftype, uint32_t pin);
/* get GPIO pin input status */
FlagStatus gpio_input_bit_get(uint32_t gpio_periph, uint32_t pin);
/* get GPIO port input status */
uint16_t gpio_input_port_get(uint32_t gpio_periph);
/* get GPIO pin output status */
FlagStatus gpio_output_bit_get(uint32_t gpio_periph, uint32_t pin);
/* get GPIO port output status */
uint16_t gpio_output_port_get(uint32_t gpio_periph);

/* set GPIO alternate function */
void gpio_af_set(uint32_t gpio_periph, uint32_t alt_func_num, uint32_t pin);
/* lock GPIO pin bit */
void gpio_pin_lock(uint32_t gpio_periph, uint32_t pin);

/* toggle GPIO pin status */
void gpio_bit_toggle(uint32_t gpio_periph, uint32_t pin);
/* toggle GPIO port status */
void gpio_port_toggle(uint32_t gpio_periph);

#endif /* GD32H77X_78X_GPIO_H */
